#Область ПрограммныйИнтерфейс

Процедура ОткрытьФормуНачалаРаботыСПрограммой() Экспорт
	
	ОбработчикЗакрытия = Новый ОписаниеОповещения("ОбработкаЗакрытияФормыНачалаРаботы", ЭтотОбъект);
	ОткрытьФорму("Обработка.НачалоРаботыСПрограммой.Форма",,,,,,
		ОбработчикЗакрытия, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаЗакрытияФормыНачалаРаботы(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	НачалоРаботыСПрограммойВызовСервера.УстановитьДатуПервогоВходаВСистему();
	
КонецПроцедуры

#КонецОбласти
