
&НаКлиенте
Процедура СуммаBYNПриИзменении(Элемент)
	ПересчитатьИзВалюты("BYN");
КонецПроцедуры

&НаКлиенте
Процедура СуммаUSDПриИзменении(Элемент)
	ПересчитатьИзВалюты("USD");
КонецПроцедуры

&НаКлиенте
Процедура СуммаEURПриИзменении(Элемент)
	ПересчитатьИзВалюты("EUR");
КонецПроцедуры

&НаКлиенте
Процедура СуммаRUBПриИзменении(Элемент)
	ПересчитатьИзВалюты("RUB");
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИзВалюты(КодИсходнойВалюты)
	
	Если КодИсходнойВалюты = "BYN" Тогда
		Сумма = СуммаBYN;
	ИначеЕсли КодИсходнойВалюты = "USD" Тогда
		Сумма = СуммаUSD;
	ИначеЕсли КодИсходнойВалюты = "EUR" Тогда
		Сумма = СуммаEUR;
	ИначеЕсли КодИсходнойВалюты = "RUB" Тогда
		Сумма = СуммаRUB;
	КонецЕсли;
	
	Результат = ПересчитатьСуммыНаСервере(Сумма,КодИсходнойВалюты);
	
	СуммаBYN = Результат.BYN;
	СуммаUSD = Результат.USD;
	СуммаEUR = Результат.EUR;
	СуммаRUB = Результат.RUB;
	
КонецПроцедуры

&НаСервере
Функция ПересчитатьСуммыНаСервере(Сумма, КодИсходнойВалюты)
	ДатаКурса = ТекущаяДата();
	
	ВалютаBYN = ПолучитьВалютуПоКоду("BYN");
	ВалютаUSD = ПолучитьВалютуПоКоду("USD");
	ВалютаEUR = ПолучитьВалютуПоКоду("EUR");
	ВалютаRUB = ПолучитьВалютуПоКоду("RUB");
	
	ИсходнаяВалюта = ПолучитьВалютуПоКоду(КодИсходнойВалюты);
	
	Результат = Новый Структура;
	
	Результат.Вставить(
		"BYN",
		РаботаСКурсамиВалют.ПересчитатьВВалюту(
			Сумма,
			ИсходнаяВалюта,
			ВалютаBYN,
			ДатаКурса
		)
	);
	
	Результат.Вставить(
		"USD",
		РаботаСКурсамиВалют.ПересчитатьВВалюту(
			Сумма,
			ИсходнаяВалюта,
			ВалютаUSD,
			ДатаКурса
		)
	);
	
	Результат.Вставить(
		"EUR",
		РаботаСКурсамиВалют.ПересчитатьВВалюту(
			Сумма,
			ИсходнаяВалюта,
			ВалютаEUR,
			ДатаКурса
		)
	);
	
	Результат.Вставить(
		"RUB",
		РаботаСКурсамиВалют.ПересчитатьВВалюту(
			Сумма,
			ИсходнаяВалюта,
			ВалютаRUB,
			ДатаКурса
		)
	);
	
	Возврат Результат;
КонецФункции  

&НаСервере
Функция ПолучитьВалютуПоКоду(КодВалюты)
	
	Если КодВалюты = "RUB" Тогда
		Возврат Справочники.Валюты.НайтиПоКоду("643");
		
	ИначеЕсли КодВалюты = "USD" Тогда
		Возврат Справочники.Валюты.НайтиПоКоду("840");
		
	ИначеЕсли КодВалюты = "EUR" Тогда
		Возврат Справочники.Валюты.НайтиПоКоду("978");
		
	ИначеЕсли КодВалюты = "BYN" Тогда
		Возврат Справочники.Валюты.НайтиПоКоду("933");
	КонецЕсли;
	
	Возврат Справочники.Валюты.ПустаяСсылка();
	
КонецФункции
