#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КоличествоТоваров = 1000;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьТовары(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	// 1. Запуск фонового задания на сервере
	ДлительнаяОперация = НачатьСозданиеТоваровВФоне();
	
	// 2. Подключение обработчика ожидания завершения фонового заданий
	ОповещениеОЗавершении = Новый ОписаниеОповещения("СоздатьТоварыЗавершение", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = "Создание товаров";
	ПараметрыОжидания.ТекстСообщения = "Выполняется создание товаров";
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;
	ПараметрыОжидания.ОповещениеПользователя.Текст = "Создание товаров завершено";
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры      

&НаКлиенте
Процедура СоздатьТоварыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Результат.Статус = "Ошибка" Тогда
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		Возврат;
	КонецЕсли;

	ОповеститьОбИзменении(Тип("СправочникСсылка.Номенклатура"));

КонецПроцедуры

&НаКлиенте
Процедура УдалитьТовары(Команда)

	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	// 1. Запуск фонового задания на сервере
	ДлительнаяОперация = НачатьУдалениеТоваровВФоне();
	
	// 2. Подключение обработчика ожидания завершения фонового заданий
	ОповещениеОЗавершении = Новый ОписаниеОповещения("УдалитьТоварыЗавершение", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = "Удаление товаров";
	ПараметрыОжидания.ТекстСообщения = "Выполняется удаление товаров";
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;
	ПараметрыОжидания.ОповещениеПользователя.Текст = "Удаление товаров завершено";
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаКлиенте
Процедура УдалитьТоварыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Результат.Статус = "Ошибка" Тогда
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		Возврат;
	КонецЕсли;

	ОповеститьОбИзменении(Тип("СправочникСсылка.Номенклатура"));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция НачатьСозданиеТоваровВФоне()          
	//ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	//ПараметрыВыполнения.УточнениеОшибки = "Не удалось создать товары";
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(, 
		"Обработки.НачальноеЗаполнение.СоздатьТовары", КоличествоТоваров);
КонецФункции

&НаСервере
Функция НачатьУдалениеТоваровВФоне()
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(,"Обработки.НачальноеЗаполнение.УдалитьТовары");
КонецФункции

&НаСервере
Процедура УдалитьТоварыНаСервере()
	Обработки.НачальноеЗаполнение.УдалитьТовары();
КонецПроцедуры

#КонецОбласти