#Область ОбработчикиСобытий

&НаКлиенте
Асинх Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Заголовок = "Выберите файл c каталогом товаров";
	ДиалогВыбораФайла.Фильтр 	= "Файл XML (*.xml)|*.xml";
	
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла 	= Истина;
	ДиалогВыбораФайла.МножественныйВыбор 			= Ложь;
	
	МассивФайлов = Ждать ДиалогВыбораФайла.ВыбратьАсинх();
	Если МассивФайлов <> Неопределено Тогда   	
		ПутьКФайлу = МассивФайлов[0];
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте  
Асинх Процедура ЗагрузитьКаталогТоваров(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда   	
		Возврат;
	КонецЕсли;
	
	ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,, ПутьКФайлу);
	Если ОписаниеФайла <> Неопределено Тогда
		
		ДанныеФайла = ПолучитьИзВременногоХранилища(ОписаниеФайла.Адрес);
		
		ДлительнаяОперация = НачатьЗагрузкиТоваровВФоне(ДанныеФайла, ОбновлятьСуществующуюНоменклатуру);
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьКаталогТоваровЗавершение", ЭтотОбъект);
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.Заголовок = "Загрузка товаров из файла";
		ПараметрыОжидания.ТекстСообщения = "Выполняется создание товаров";
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
		ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;
		ПараметрыОжидания.ОповещениеПользователя.Текст = "Загрузка товаров завершена";
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗагрузитьКаталогТоваровЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Результат.Статус = "Ошибка" Тогда
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(
			Результат.ИнформацияОбОшибке
		);
		Возврат;
	КонецЕсли;

	ОповеститьОбИзменении(Тип("СправочникСсылка.Номенклатура"));

КонецПроцедуры

&НаСервере
Функция НачатьЗагрузкиТоваровВФоне(ДанныеФайла, ОбновлятьСуществующуюНоменклатуру)         
	//ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	//ПараметрыВыполнения.УточнениеОшибки = "Не удалось создать товары";
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(
		, 
		"Обработки.ЗагрузкаКаталогаТоваровИзФайлаXML.ЗагрузкаКаталогаТоваров",
		ДанныеФайла,
		ОбновлятьСуществующуюНоменклатуру
	);
КонецФункции

#КонецОбласти






















