#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НачатьРаботу(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	СоздатьОрганизацию();
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьОрганизацию()
	
	Организация = Справочники.Организации.СоздатьЭлемент();
	Организация.ИНН = ИНН;
	Организация.КПП = КПП;
	Организация.Наименование = Наименование;
	Организация.НаименованиеПолное = Наименование;
	Организация.Записать();
	
КонецПроцедуры

#КонецОбласти

