#Область ПрограммныйИнтерфейс

Процедура СоздатьТовары(Количество) Экспорт

	Для Счетчик = 1 По Количество Цикл
		НовыйТовар = Справочники.Номенклатура.СоздатьЭлемент();		
		НовыйТовар.Наименование = СтрШаблон("Товар № %1", Счетчик);
		НовыйТовар.Записать();
		ДлительныеОперации.СообщитьПрогресс(100 * Счетчик / Количество);
	КонецЦикла;
	
КонецПроцедуры                    

Процедура УдалитьТовары() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТекОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Попытка
			ТекОбъект.Заблокировать();		
			ТекОбъект.Удалить();
		Исключение			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			Уточнение = ОбщегоНазначенияКлиентСервер.УточнениеИсключения(ИнформацияОбОшибке,
							НСтр("ru = 'Не удалось удалить товары из справочника:'"));
			ДляАдминистратора = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			ВызватьИсключение(Уточнение.Текст, Уточнение.Категория,, ДляАдминистратора, ИнформацияОбОшибке);
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
